# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_kubernetes_cluster.k6tests will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_kubernetes_cluster" "k6tests" {
      + aci_connector_linux                              = (known after apply)
      + agent_pool_profile                               = (known after apply)
      + api_server_authorized_ip_ranges                  = (known after apply)
      + azure_active_directory_role_based_access_control = (known after apply)
      + azure_policy_enabled                             = (known after apply)
      + current_kubernetes_version                       = (known after apply)
      + disk_encryption_set_id                           = (known after apply)
      + dns_prefix                                       = (known after apply)
      + fqdn                                             = (known after apply)
      + http_application_routing_enabled                 = (known after apply)
      + http_application_routing_zone_name               = (known after apply)
      + id                                               = (known after apply)
      + identity                                         = (known after apply)
      + ingress_application_gateway                      = (known after apply)
      + key_management_service                           = (known after apply)
      + key_vault_secrets_provider                       = (known after apply)
      + kube_admin_config                                = (sensitive value)
      + kube_admin_config_raw                            = (sensitive value)
      + kube_config                                      = (sensitive value)
      + kube_config_raw                                  = (sensitive value)
      + kubelet_identity                                 = (known after apply)
      + kubernetes_version                               = (known after apply)
      + linux_profile                                    = (known after apply)
      + location                                         = (known after apply)
      + microsoft_defender                               = (known after apply)
      + name                                             = "k6tests-cluster-F7sT-XPTO"
      + network_profile                                  = (known after apply)
      + node_resource_group                              = (known after apply)
      + node_resource_group_id                           = (known after apply)
      + oidc_issuer_enabled                              = (known after apply)
      + oidc_issuer_url                                  = (known after apply)
      + oms_agent                                        = (known after apply)
      + open_service_mesh_enabled                        = (known after apply)
      + private_cluster_enabled                          = (known after apply)
      + private_fqdn                                     = (known after apply)
      + resource_group_name                              = "k6tests-rg-F7sT-XPTO"
      + role_based_access_control_enabled                = (known after apply)
      + service_mesh_profile                             = (known after apply)
      + service_principal                                = (known after apply)
      + storage_profile                                  = (known after apply)
      + tags                                             = (known after apply)
      + windows_profile                                  = (known after apply)
    }

  # data.azurerm_monitor_data_collection_endpoint.k6tests will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_data_collection_endpoint" "k6tests" {
      + configuration_access_endpoint = (known after apply)
      + description                   = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + kind                          = (known after apply)
      + location                      = (known after apply)
      + logs_ingestion_endpoint       = (known after apply)
      + metrics_ingestion_endpoint    = (known after apply)
      + name                          = "k6tests-amw-F7sT-XPTO"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "MA_k6tests-amw-F7sT-XPTO_norwayeast_managed"
      + tags                          = (known after apply)
    }

  # data.azurerm_monitor_data_collection_rule.k6tests will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_data_collection_rule" "k6tests" {
      + data_collection_endpoint_id = (known after apply)
      + data_flow                   = (known after apply)
      + data_sources                = (known after apply)
      + description                 = (known after apply)
      + destinations                = (known after apply)
      + id                          = (known after apply)
      + identity                    = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = (known after apply)
      + location                    = (known after apply)
      + name                        = "k6tests-dcr-F7sT-XPTO"
      + resource_group_name         = "k6tests-rg-F7sT-XPTO"
      + stream_declaration          = (known after apply)
      + tags                        = (known after apply)
    }

  # module.foundational.azurerm_kubernetes_cluster.k6tests must be replaced
-/+ resource "azurerm_kubernetes_cluster" "k6tests" {
      - azure_policy_enabled                = false -> null
      - cost_analysis_enabled               = false -> null
      ~ current_kubernetes_version          = "1.31.7" -> (known after apply)
      ~ dns_prefix                          = "k6tests-cluster-F7sT" -> "k6tests-cluster-F7sT-XPTO" # forces replacement
      ~ fqdn                                = "k6tests-cluster-f7st-3lrdqw1p.hcp.norwayeast.azmk8s.io" -> (known after apply)
      - http_application_routing_enabled    = false -> null
      + http_application_routing_zone_name  = (known after apply)
      ~ id                                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster-F7sT" -> (known after apply)
      ~ kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      ~ kube_config                         = (sensitive value)
      ~ kube_config_raw                     = (sensitive value)
      ~ kubernetes_version                  = "1.31.7" -> (known after apply)
      ~ name                                = "k6tests-cluster-F7sT" -> "k6tests-cluster-F7sT-XPTO" # forces replacement
      ~ node_resource_group                 = "MC_k6tests-rg-F7sT_k6tests-cluster-F7sT_norwayeast" -> (known after apply)
      ~ node_resource_group_id              = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MC_k6tests-rg-F7sT_k6tests-cluster-F7sT_norwayeast" -> (known after apply)
      ~ oidc_issuer_url                     = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/ad6108ad-c807-45af-9f6e-7807f38ff4ea/" -> (known after apply)
      - open_service_mesh_enabled           = false -> null
      ~ portal_fqdn                         = "k6tests-cluster-f7st-3lrdqw1p.portal.hcp.norwayeast.azmk8s.io" -> (known after apply)
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      ~ resource_group_name                 = "k6tests-rg-F7sT" -> "k6tests-rg-F7sT-XPTO" # forces replacement
      - tags                                = {} -> null
        # (15 unchanged attributes hidden)

      ~ auto_scaler_profile (known after apply)
      - auto_scaler_profile {
          - balance_similar_node_groups                   = false -> null
          - daemonset_eviction_for_empty_nodes_enabled    = false -> null
          - daemonset_eviction_for_occupied_nodes_enabled = true -> null
          - empty_bulk_delete_max                         = "10" -> null
          - expander                                      = "random" -> null
          - ignore_daemonsets_utilization_enabled         = false -> null
          - max_graceful_termination_sec                  = "600" -> null
          - max_node_provisioning_time                    = "15m" -> null
          - max_unready_nodes                             = 3 -> null
          - max_unready_percentage                        = 45 -> null
          - new_pod_scale_up_delay                        = "0s" -> null
          - scale_down_delay_after_add                    = "10m" -> null
          - scale_down_delay_after_delete                 = "10s" -> null
          - scale_down_delay_after_failure                = "3m" -> null
          - scale_down_unneeded                           = "10m" -> null
          - scale_down_unready                            = "20m" -> null
          - scale_down_utilization_threshold              = "0.5" -> null
          - scan_interval                                 = "10s" -> null
          - skip_nodes_with_local_storage                 = false -> null
          - skip_nodes_with_system_pods                   = true -> null
        }

      ~ default_node_pool {
          - fips_enabled                  = false -> null
          - host_encryption_enabled       = false -> null
          ~ kubelet_disk_type             = "OS" -> (known after apply)
            name                          = "default"
          ~ node_count                    = 1 -> (known after apply)
          ~ node_labels                   = {} -> (known after apply)
          - node_public_ip_enabled        = false -> null
          - only_critical_addons_enabled  = false -> null
          ~ orchestrator_version          = "1.31.7" -> (known after apply)
          ~ os_disk_size_gb               = 128 -> (known after apply)
          ~ os_sku                        = "Ubuntu" -> (known after apply)
          - tags                          = {} -> null
          + workload_runtime              = (known after apply)
          - zones                         = [] -> null
            # (18 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "8ab0c11e-717a-4c6b-aa5c-9136656376db" -> (known after apply)
          ~ tenant_id    = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ kubelet_identity (known after apply)
      - kubelet_identity {
          - client_id                 = "e13ee565-1ce4-4fbf-8526-7d6dfcf65657" -> null
          - object_id                 = "8fdd2748-0d93-4b74-8e79-1dc25272b7d8" -> null
          - user_assigned_identity_id = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MC_k6tests-rg-F7sT_k6tests-cluster-F7sT_norwayeast/providers/Microsoft.ManagedIdentity/userAssignedIdentities/k6tests-cluster-F7sT-agentpool" -> null
        }

      ~ network_profile (known after apply)
      - network_profile {
          - dns_service_ip      = "10.0.0.10" -> null
          - ip_versions         = [
              - "IPv4",
            ] -> null
          - load_balancer_sku   = "standard" -> null
          - network_data_plane  = "azure" -> null
          - network_plugin      = "azure" -> null
          - network_plugin_mode = "overlay" -> null
          - outbound_type       = "loadBalancer" -> null
          - pod_cidr            = "10.244.0.0/16" -> null
          - pod_cidrs           = [
              - "10.244.0.0/16",
            ] -> null
          - service_cidr        = "10.0.0.0/16" -> null
          - service_cidrs       = [
              - "10.0.0.0/16",
            ] -> null
            # (2 unchanged attributes hidden)

          - load_balancer_profile {
              - backend_pool_type           = "NodeIPConfiguration" -> null
              - effective_outbound_ips      = [
                  - "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MC_k6tests-rg-F7sT_k6tests-cluster-F7sT_norwayeast/providers/Microsoft.Network/publicIPAddresses/c81e63c0-f642-4631-b353-49215ace335c",
                ] -> null
              - idle_timeout_in_minutes     = 0 -> null
              - managed_outbound_ip_count   = 1 -> null
              - managed_outbound_ipv6_count = 0 -> null
              - outbound_ip_address_ids     = [] -> null
              - outbound_ip_prefix_ids      = [] -> null
              - outbound_ports_allocated    = 0 -> null
            }
        }

      ~ oms_agent {
          ~ log_analytics_workspace_id      = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.OperationalInsights/workspaces/k6tests-law-F7sT" -> (known after apply)
          ~ oms_agent_identity              = [] -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ windows_profile (known after apply)

        # (1 unchanged block hidden)
    }

  # module.foundational.azurerm_kubernetes_cluster_node_pool.prometheus must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "prometheus" {
      - fips_enabled                  = false -> null
      - host_encryption_enabled       = false -> null
      ~ id                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster-F7sT/agentPools/prometheus" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ kubernetes_cluster_id         = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster-F7sT" -> (known after apply) # forces replacement
      - max_count                     = 0 -> null
      ~ max_pods                      = 250 -> (known after apply)
      - min_count                     = 0 -> null
        name                          = "prometheus"
      - node_public_ip_enabled        = false -> null
      ~ orchestrator_version          = "1.31.7" -> (known after apply)
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
      - tags                          = {} -> null
      - zones                         = [] -> null
        # (19 unchanged attributes hidden)
    }

  # module.foundational.azurerm_kubernetes_cluster_node_pool.spot must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "spot" {
      - fips_enabled                  = false -> null
      - host_encryption_enabled       = false -> null
      ~ id                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster-F7sT/agentPools/spot" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ kubernetes_cluster_id         = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster-F7sT" -> (known after apply) # forces replacement
        name                          = "spot"
      - node_public_ip_enabled        = false -> null
      ~ orchestrator_version          = "1.31.7" -> (known after apply)
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
      - tags                          = {} -> null
      - zones                         = [] -> null
        # (22 unchanged attributes hidden)
    }

  # module.foundational.azurerm_log_analytics_workspace.k6tests must be replaced
-/+ resource "azurerm_log_analytics_workspace" "k6tests" {
      - cmk_for_query_forced                    = false -> null
      ~ id                                      = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.OperationalInsights/workspaces/k6tests-law-F7sT" -> (known after apply)
      - immediate_data_purge_on_30_days_enabled = false -> null
      ~ name                                    = "k6tests-law-F7sT" -> "k6tests-law-F7sT-XPTO" # forces replacement
      ~ primary_shared_key                      = (sensitive value)
      ~ resource_group_name                     = "k6tests-rg-F7sT" -> "k6tests-rg-F7sT-XPTO" # forces replacement
      ~ secondary_shared_key                    = (sensitive value)
      ~ sku                                     = "PerGB2018" -> (known after apply)
      - tags                                    = {} -> null
      ~ workspace_id                            = "b2e8de64-9da0-4306-952e-a38e562855e5" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.foundational.azurerm_monitor_data_collection_rule.k6tests must be replaced
-/+ resource "azurerm_monitor_data_collection_rule" "k6tests" {
      ~ id                          = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.Insights/dataCollectionRules/k6tests-dcr-F7sT" -> (known after apply)
      ~ immutable_id                = "dcr-e1d754e0800647b6930fc57a08aa3c7c" -> (known after apply)
      ~ name                        = "k6tests-dcr-F7sT" -> "k6tests-dcr-F7sT-XPTO" # forces replacement
      ~ resource_group_name         = "k6tests-rg-F7sT" -> "k6tests-rg-F7sT-XPTO" # forces replacement
      - tags                        = {} -> null
        # (4 unchanged attributes hidden)

      ~ data_sources {
          ~ extension {
              - input_data_sources = [] -> null
                name               = "ContainerInsightsExtension"
                # (3 unchanged attributes hidden)
            }
        }

      ~ destinations {
          ~ log_analytics {
                name                  = "ciworkspace"
              ~ workspace_resource_id = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.OperationalInsights/workspaces/k6tests-law-F7sT" -> (known after apply)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.foundational.azurerm_monitor_data_collection_rule_association.k6tests must be replaced
-/+ resource "azurerm_monitor_data_collection_rule_association" "k6tests" {
      ~ data_collection_rule_id     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.Insights/dataCollectionRules/k6tests-dcr-F7sT" -> (known after apply)
      ~ id                          = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster-F7sT/providers/Microsoft.Insights/dataCollectionRuleAssociations/ContainerInsightsExtension" -> (known after apply)
        name                        = "ContainerInsightsExtension"
      ~ target_resource_id          = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster-F7sT" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.foundational.azurerm_monitor_workspace.k6tests must be replaced
-/+ resource "azurerm_monitor_workspace" "k6tests" {
      ~ default_data_collection_endpoint_id = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw-f7st_norwayeast_managed/providers/Microsoft.Insights/dataCollectionEndpoints/k6tests-amw-f7st" -> (known after apply)
      ~ default_data_collection_rule_id     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw-f7st_norwayeast_managed/providers/Microsoft.Insights/dataCollectionRules/k6tests-amw-f7st" -> (known after apply)
      ~ id                                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.Monitor/accounts/k6tests-amw-F7sT" -> (known after apply)
      ~ name                                = "k6tests-amw-F7sT" -> "k6tests-amw-F7sT-XPTO" # forces replacement
      ~ query_endpoint                      = "https://k6tests-amw-f7st-evf5e7bzbegdhacu.norwayeast.prometheus.monitor.azure.com" -> (known after apply)
      ~ resource_group_name                 = "k6tests-rg-F7sT" -> "k6tests-rg-F7sT-XPTO" # forces replacement
      - tags                                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.foundational.azurerm_resource_group.k6tests must be replaced
-/+ resource "azurerm_resource_group" "k6tests" {
      ~ id         = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT" -> (known after apply)
      ~ name       = "k6tests-rg-F7sT" -> "k6tests-rg-F7sT-XPTO" # forces replacement
      - tags       = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.foundational.azurerm_role_assignment.azure_kubernetes_service_cluster_user_role must be replaced
-/+ resource "azurerm_role_assignment" "azure_kubernetes_service_cluster_user_role" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster-F7sT/providers/Microsoft.Authorization/roleAssignments/2ade6766-d977-9b22-5419-99cb4613a7ac" -> (known after apply)
      ~ name                                   = "2ade6766-d977-9b22-5419-99cb4613a7ac" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/4abbcc35-e782-43d8-92c5-2d3f1bd2253f" -> (known after apply)
      ~ scope                                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster-F7sT" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.foundational.azurerm_role_assignment.reader_user_role must be replaced
-/+ resource "azurerm_role_assignment" "reader_user_role" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.OperationalInsights/workspaces/k6tests-law-F7sT/providers/Microsoft.Authorization/roleAssignments/1e0e14c1-b6d3-07ae-22c8-678aaed6d701" -> (known after apply)
      ~ name                                   = "1e0e14c1-b6d3-07ae-22c8-678aaed6d701" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      ~ scope                                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.OperationalInsights/workspaces/k6tests-law-F7sT" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.services.azuread_application.prometheus will be updated in-place
  ~ resource "azuread_application" "prometheus" {
      ~ display_name                   = "adminservicestest-k6tests-prometheus-F7sT" -> "adminservicestest-k6tests-prometheus-F7sT-XPTO"
        id                             = "/applications/14406d89-2c70-4bb9-96c4-252f667156ff"
        tags                           = []
        # (24 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.services.azuread_application_federated_identity_credential.prometheus must be replaced
-/+ resource "azuread_application_federated_identity_credential" "prometheus" {
      ~ credential_id  = "6a72038e-3832-451a-9b3c-e5121f92e1ae" -> (known after apply)
      ~ display_name   = "adminservicestest-k6tests-prometheus-F7sT" -> "adminservicestest-k6tests-prometheus-F7sT-XPTO" # forces replacement
      ~ id             = "14406d89-2c70-4bb9-96c4-252f667156ff/federatedIdentityCredential/6a72038e-3832-451a-9b3c-e5121f92e1ae" -> (known after apply)
      ~ issuer         = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/ad6108ad-c807-45af-9f6e-7807f38ff4ea/" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.services.azurerm_role_assignment.monitoring_metrics_publisher must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_metrics_publisher" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw-F7sT_norwayeast_managed/providers/Microsoft.Insights/dataCollectionEndpoints/k6tests-amw-F7sT/providers/Microsoft.Authorization/roleAssignments/d7ab9fab-5e56-9e98-5092-e7ea1b2b07c8" -> (known after apply)
      ~ name                                   = "d7ab9fab-5e56-9e98-5092-e7ea1b2b07c8" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/3913510d-42f4-4e42-8a64-420c390055eb" -> (known after apply)
      ~ scope                                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw-F7sT_norwayeast_managed/providers/Microsoft.Insights/dataCollectionEndpoints/k6tests-amw-F7sT" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.services.helm_release.kube_prometheus_stack will be updated in-place
  ~ resource "helm_release" "kube_prometheus_stack" {
        id                         = "kube-prometheus-stack"
      ~ metadata                   = [
          - {
              - app_version    = "v0.81.0"
              - chart          = "kube-prometheus-stack"
              - first_deployed = 1744372042
              - last_deployed  = 1744372042
              - name           = "kube-prometheus-stack"
              - namespace      = "monitoring"
              - notes          = <<-EOT
                    kube-state-metrics is a simple service that listens to the Kubernetes API server and generates metrics about the state of the objects.
                    The exposed metrics can be found here:
                    https://github.com/kubernetes/kube-state-metrics/blob/master/docs/README.md#exposed-metrics
                    
                    The metrics are exported on the HTTP endpoint /metrics on the listening port.
                    In your case, kube-prometheus-stack-kube-state-metrics.monitoring.svc.cluster.local:8080/metrics
                    
                    They are served either as plaintext or protobuf depending on the Accept header.
                    They are designed to be consumed either by Prometheus itself or by a scraper that is compatible with scraping a Prometheus client endpoint.
                    
                    kube-prometheus-stack has been installed. Check its status by running:
                      kubectl --namespace monitoring get pods -l "release=kube-prometheus-stack"
                    
                    Get Grafana 'admin' user password by running:
                    
                      kubectl --namespace monitoring get secrets kube-prometheus-stack-grafana -o jsonpath="{.data.admin-password}" | base64 -d ; echo
                    
                    Access Grafana local instance:
                    
                      export POD_NAME=$(kubectl --namespace monitoring get pod -l "app.kubernetes.io/name=grafana,app.kubernetes.io/instance=kube-prometheus-stack" -oname)
                      kubectl --namespace monitoring port-forward $POD_NAME 3000
                    
                    Visit https://github.com/prometheus-operator/kube-prometheus for instructions on how to create & configure Alertmanager and Prometheus instances using the Operator.
                    
                    1. Get the application URL by running these commands:
                      export POD_NAME=$(kubectl get pods --namespace monitoring -l "app.kubernetes.io/name=prometheus-node-exporter,app.kubernetes.io/instance=kube-prometheus-stack" -o jsonpath="{.items[0].metadata.name}")
                      echo "Visit http://127.0.0.1:9100 to use your application"
                      kubectl port-forward --namespace monitoring $POD_NAME 9100
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - alertmanager = {
                          - enabled = true
                        }
                      - crds         = {
                          - enabled = false
                        }
                      - grafana      = {
                          - enabled = false
                        }
                      - prometheus   = {
                          - enabled        = true
                          - prometheusSpec = {
                              - enableRemoteWriteReceiver = true
                              - externalLabels            = {
                                  - cluster = "k6tests-cluster-F7sT"
                                }
                              - nodeSelector              = {
                                  - workload = "prometheus"
                                }
                              - podMetadata               = {
                                  - labels = {
                                      - "azure.workload.identity/use" = "true"
                                    }
                                }
                              - priorityClassName         = "system-cluster-critical"
                              - remoteWrite               = [
                                  - {
                                      - azureAd = {
                                          - cloud = "AzurePublic"
                                          - sdk   = {
                                              - tenantId = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
                                            }
                                        }
                                      - url     = "https://k6tests-amw-f7st-jewy.norwayeast-1.metrics.ingest.monitor.azure.com/dataCollectionRules/dcr-e1d754e0800647b6930fc57a08aa3c7c/streams/Microsoft-PrometheusMetrics/api/v1/write?api-version=2023-04-24"
                                    },
                                ]
                              - resources                 = {
                                  - requests = {
                                      - memory = "8Gi"
                                    }
                                }
                              - retention                 = "8d"
                              - storageSpec               = {
                                  - volumeClaimTemplate = {
                                      - spec = {
                                          - resources = {
                                              - requests = {
                                                  - storage = "64Gi"
                                                }
                                            }
                                        }
                                    }
                                }
                              - tolerations               = [
                                  - {
                                      - effect   = "NoSchedule"
                                      - key      = "workload"
                                      - operator = "Equal"
                                      - value    = "prometheus"
                                    },
                                ]
                            }
                          - serviceAccount = {
                              - annotations = {
                                  - "azure.workload.identity/client-id" = "0626b615-9933-46fc-84ec-b08ad8bb1b79"
                                }
                            }
                        }
                    }
                )
              - version        = "70.0.2"
            },
        ] -> (known after apply)
        name                       = "kube-prometheus-stack"
      ~ values                     = [
          - <<-EOT
                crds:
                  enabled: false
                alertmanager:
                  enabled: true
                grafana:
                  enabled: false
                prometheus:
                  enabled: true
                  serviceAccount:
                    annotations:
                      azure.workload.identity/client-id: "0626b615-9933-46fc-84ec-b08ad8bb1b79"
                  prometheusSpec:
                    podMetadata:
                      labels:
                        azure.workload.identity/use: "true"
                    externalLabels:
                      cluster: "k6tests-cluster-F7sT"
                    enableRemoteWriteReceiver: true
                    remoteWrite:
                      - url: "https://k6tests-amw-f7st-jewy.norwayeast-1.metrics.ingest.monitor.azure.com/dataCollectionRules/dcr-e1d754e0800647b6930fc57a08aa3c7c/streams/Microsoft-PrometheusMetrics/api/v1/write?api-version=2023-04-24"
                        azureAd:
                          cloud: "AzurePublic"
                          sdk:
                            tenantId: "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
                    tolerations:
                      - key: "workload"
                        operator: "Equal"
                        value: "prometheus"
                        effect: "NoSchedule"
                    resources:
                      requests:
                        memory: 8Gi
                    nodeSelector:
                      workload: "prometheus"
                    priorityClassName: "system-cluster-critical"
                    retention: 8d
                    storageSpec:
                      volumeClaimTemplate:
                        spec:
                          resources:
                            requests:
                              storage: 64Gi
            EOT,
        ] -> (known after apply)
        # (26 unchanged attributes hidden)
    }

Plan: 12 to add, 2 to change, 12 to destroy.

Changes to Outputs:
  ~ k6tests_cluster_name        = "k6tests-cluster-F7sT" -> "k6tests-cluster-F7sT-XPTO"
  ~ k6tests_resource_group_name = "k6tests-rg-F7sT" -> "k6tests-rg-F7sT-XPTO"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/k6tests-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/k6tests-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_k6tests-rg.tfstate.tfplan`